![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 2

Neste Jupyter notebook você irá resolver uma exercícios utilizando a biblioteca Pandas.\
Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.\
Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

#### Tarefa 1. Importe o dataset e salve os dados em um dataframe

Os dados estão salvos no arquivo ***datasets/US_Crime_Rates_1960_2014.csv***.\
Este dataset contém dados de crimes ocorridos nos Estados Unidos no período de 1960 até 2014.\
Salve os dados em uma variável de nome *crime*.

In [2]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/dancbatista/data-manipulation-exercises/master/datasets/US_Crime_Rates_1960_2014.csv")

#### Tarefa 2. Qual o tipo de dados em cada coluna?

In [3]:
df.dtypes

Year                  int64
Population            int64
Total                 int64
Violent               int64
Property              int64
Murder                int64
Forcible_Rape         int64
Robbery               int64
Aggravated_assault    int64
Burglary              int64
Larceny_Theft         int64
Vehicle_Theft         int64
dtype: object

#### Tarefa 3. Converta o tipo de dado da coluna Year para o tipo datetime

*Dica: procure na documentação da biblioteca como fazer tal conversão*

In [4]:
pd.to_datetime(df['Year']).head()

0   1970-01-01 00:00:00.000001960
1   1970-01-01 00:00:00.000001961
2   1970-01-01 00:00:00.000001962
3   1970-01-01 00:00:00.000001963
4   1970-01-01 00:00:00.000001964
Name: Year, dtype: datetime64[ns]

#### Tarefa 4. Configure a coluna Year como index do DataFrame.

*Dica: use a função set_index() do Pandas*

In [5]:
df.set_index('Year').head()

      Population    Total  Violent  ...  Burglary  Larceny_Theft  Vehicle_Theft
Year                                ...
1960   179323175  3384200   288460  ...    912100        1855400         328200
1961   182992000  3488000   289390  ...    949600        1913000         336000
1962   185771000  3752200   301510  ...    994300        2089600         366800
1963   188483000  4109500   316970  ...   1086400        2297800         408300
1964   191141000  4564600   364220  ...   1213200        2514400         472800

[5 rows x 11 columns]

#### Tarefa 5. Remova a coluna Total do DataFrame.

In [6]:
df.drop(columns=['Total']).head()

   Year  Population  Violent  ...  Burglary  Larceny_Theft  Vehicle_Theft
0  1960   179323175   288460  ...    912100        1855400         328200
1  1961   182992000   289390  ...    949600        1913000         336000
2  1962   185771000   301510  ...    994300        2089600         366800
3  1963   188483000   316970  ...   1086400        2297800         408300
4  1964   191141000   364220  ...   1213200        2514400         472800

[5 rows x 11 columns]

#### Tarefa 6. Encontre o número de roubos de carro do ano de 1978.

In [7]:
df.loc[df['Year'] == 1978, "Vehicle_Theft"]

18    1004100
Name: Vehicle_Theft, dtype: int64

#### Tarefa 7. Retorne a linha do ano em que houve o maior número de assasinatos. 

*Dica: use a coluna Murder como referência.*

In [19]:
df.loc[df["Murder"] == df['Murder'].max()]

    Year  Population     Total  ...  Burglary  Larceny_Theft  Vehicle_Theft
31  1991   252177000  14872900  ...   3157200        8142200        1661700

[1 rows x 12 columns]

#### Tarefa 8. Retorne o número de assassinatos do ano em que foi registrado o menor número de roubo de carros.

In [25]:
df.loc[df['Vehicle_Theft'] == df['Vehicle_Theft'].min(), "Murder"]

0    9110
Name: Murder, dtype: int64

**Parabéns! Você chegou ao fim**